[
    {
        "id": 1,
        "title_en": "Numerical Harmony in Creation",
        "title_ar": "الانسجام العددي في الخلق",
        "ayah_ar": "إِنَّا كُلَّ شَيْءٍ خَلَقْنَاهُ بِقَدَرٍ",
        "ayah_en": "Indeed, We have created all things with precise measure.",
        "reference": "54:49",
        "description": "• “Male” appears 23 times\n• “Female” appears 23 times\n→ together 46 chromosomes\n\n• “Day” appears 365 times\n• “Month” appears 12 times\n\n• The People of the Cave stayed 309 years\n→ 300 solar = 309 lunar\n\nThese are not math lessons.\nThey are quiet signs of a perfect design."
    },
    {
        "id": 2,
        "title_en": "Iron Sent Down",
        "title_ar": "إنزال الحديد",
        "ayah_ar": "وَأَنزَلْنَا الْحَدِيدَ فِيهِ بَأْسٌ شَدِيدٌ وَمَنَافِعُ لِلنَّاسِ",
        "ayah_en": "And We sent down iron, in which there is great strength and benefits for people.",
        "reference": "57:25",
        "description": "The Qur’an does not say iron was created on Earth, but that it was sent down. Modern science later discovered that iron is formed in massive stars and reaches planets through cosmic events like supernovae and meteorites. Iron is also central to Earth’s core and essential to human civilization. This verse subtly connects the heavens and the Earth, showing how divine planning spans both the cosmic and the human scale."
    },
    {
        "id": 3,
        "title_en": "The Piercing Star",
        "title_ar": "النجم الطارق",
        "ayah_ar": "وَالسَّمَاءِ وَالطَّارِقِ  وَمَا أَدْرَاكَ مَا الطَّارِقُ  النَّجْمُ الثَّاقِبُ",
        "ayah_en": "By the sky and the piercing star. And what can make you know what the piercing star is? It is the star that pierces.",
        "reference": "86:1-3",
        "description": "The Qur’an describes a star whose light pierces through darkness. Today, astronomy has identified stars such as pulsars that emit intense, rhythmic bursts of radiation that truly pierce space. The language used in the verse is powerful yet precise, capturing a reality that humanity would only discover centuries later. It invites reflection on the vastness and complexity of the universe."
    },
    {
        "id": 4,
        "title_en": "Life Comes from Water",
        "title_ar": "الحياة من الماء",
        "ayah_ar": "وَجَعَلْنَا مِنَ الْمَاءِ كُلَّ شَيْءٍ حَيٍّ",
        "ayah_en": "And We made from water every living thing.",
        "reference": "21:30",
        "description": "This short verse presents a universal truth: life depends on water. Modern biology confirms that every living cell requires water to survive and function. From plants to animals to humans, water is the foundation of life. The Qur’an states this fact simply and clearly, reminding us that all living beings share a common origin and that life itself is a gift sustained by divine mercy."
    },
    {
        "id": 5,
        "title_en": "The Brightest Star",
        "title_ar": "نجم الشعرى",
        "ayah_ar": "وَأَنَّهُ هُوَ رَبُّ الشِّعْرَىٰ",
        "ayah_en": "And that He is the Lord of Sirius.",
        "reference": "53:49",
        "description": "Sirius is the brightest star visible from Earth and was worshipped by ancient civilizations. The Qur’an mentions it not to glorify the star, but to remind humanity that even the brightest and most impressive objects in the sky are creations under divine authority. It shifts attention from the star itself to the One who created it."
    },
    {
        "id": 6,
        "title_en": "Chest Tightening at High Altitude",
        "title_ar": "ضيق الصدر عند الارتفاع",
        "ayah_ar": "وَمَن يُرِدْ أَن يُضِلَّهُ يَجْعَلْ صَدْرَهُ ضَيِّقًا حَرَجًا كَأَنَّمَا يَصَّعَّدُ فِي السَّمَاءِ",
        "ayah_en": "And whoever He wills to misguide, He makes his chest tight and constricted as if he were climbing into the sky.",
        "reference": "6:125",
        "description": "As a person rises to high altitude, oxygen levels decrease, causing difficulty in breathing and a feeling of chest tightness. This physical reality was unknown in ancient times, yet the Qur’an describes it with remarkable accuracy. The verse uses this phenomenon as a powerful metaphor, connecting physical experience with spiritual states."
    },
    {
        "id": 7,
        "title_en": "The Lying Forehead",
        "title_ar": "الناصية الكاذبة",
        "ayah_ar": "نَاصِيَةٍ كَاذِبَةٍ خَاطِئَةٍ",
        "ayah_en": "A lying, sinful forehead.",
        "reference": "96:16",
        "description": "The Qur’an links lying and wrongdoing to the forehead. Modern neuroscience has shown that the prefrontal cortex, located behind the forehead, plays a key role in decision-making, self-control, and deception. This connection reflects a deep insight into human behavior long before the brain was scientifically understood."
    },
    {
        "id": 8,
        "title_en": "Divine Preservation of the Qur’an",
        "title_ar": "حفظ القرآن",
        "ayah_ar": "إِنَّا نَحْنُ نَزَّلْنَا الذِّكْرَ وَإِنَّا لَهُ لَحَافِظُونَ",
        "ayah_en": "Indeed, We have sent down the Reminder, and indeed We will preserve it.",
        "reference": "15:9",
        "description": "The Qur’an boldly claims that it will be preserved, and history confirms this claim. Through memorization, careful writing, and strict transmission methods, the Qur’an has remained unchanged for over fourteen centuries. This preservation is unique among ancient texts and continues to be a source of reflection and trust for believers."
    },
    {
        "id": 9,
        "title_en": "Multiple Easts and Wests",
        "title_ar": "تعدد المشارق والمغارب",
        "ayah_ar": "رَبُّ الْمَشْرِقَيْنِ وَرَبُّ الْمَغْرِبَيْنِ",
        "ayah_en": "Lord of the two easts and Lord of the two wests.",
        "reference": "55:17",
        "description": "The Qur’an speaks of multiple easts and wests, a concept that aligns with the Earth’s spherical shape and tilted axis. Sunrise and sunset points shift throughout the year depending on seasons and location. This flexible language reflects a deep awareness of Earth’s motion and structure."
    },
    {
        "id": 10,
        "title_en": "Healing in Honey",
        "title_ar": "الشفاء في العسل",
        "ayah_ar": "يَخْرُجُ مِن بُطُونِهَا شَرَابٌ مُّخْتَلِفٌ أَلْوَانُهُ فِيهِ شِفَاءٌ لِّلنَّاسِ",
        "ayah_en": "From their bellies comes a drink of varying colors in which there is healing for people.",
        "reference": "16:69",
        "description": "Honey has long been known for its healing properties, and modern science confirms its antibacterial and medicinal benefits. The Qur’an attributes this remarkable substance to divine inspiration given to the bee, inviting reflection on how guidance can exist even in the smallest of creatures."
    },
    {
        "id": 11,
        "title_en": "A Day Like a Thousand Years",
        "title_ar": "يوم كألف سنة",
        "ayah_ar": "يُدَبِّرُ الْأَمْرَ مِنَ السَّمَاءِ إِلَى الْأَرْضِ ثُمَّ يَعْرُجُ إِلَيْهِ فِي يَوْمٍ كَانَ مِقْدَارُهُ أَلْفَ سَنَةٍ مِّمَّا تَعُدُّونَ",
        "ayah_en": "He regulates the affair from the heaven to the earth; then it ascends to Him in a day whose measure is a thousand years of what you count.",
        "reference": "32:5",
        "description": "This verse challenges the human understanding of time. What feels long or short to us is not the same in the divine scale. The verse invites reflection on relativity, reminding us that time itself is a created concept, subject to the laws set by the Creator."
    },
    {
        "id": 12,
        "title_en": "Mountains as Pegs",
        "title_ar": "الجبال أوتادًا",
        "ayah_ar": "وَالْجِبَالَ أَوْتَادًا",
        "ayah_en": "And the mountains as pegs.",
        "reference": "78:7",
        "description": "Mountains are described as pegs that stabilize the Earth. Modern geology confirms that mountains have deep roots that anchor tectonic plates. This powerful metaphor captures a hidden reality beneath the surface of the Earth."
    },
    {
        "id": 13,
        "title_en": "The Moon Reflects Light",
        "title_ar": "نور القمر",
        "ayah_ar": "وَجَعَلَ الشَّمْسَ سِرَاجًا وَالْقَمَرَ نُورًا",
        "ayah_en": "He made the sun a burning lamp and the moon a light.",
        "reference": "71:16",
        "description": "The Qur’an carefully distinguishes between the sun as a source of burning light and the moon as a reflector of light. Science later confirmed that the moon does not emit light but reflects sunlight, a subtle yet accurate distinction."
    },
    {
        "id": 14,
        "title_en": "Three Darknesses of the Womb",
        "title_ar": "الظلمات الثلاث",
        "ayah_ar": "يَخْلُقُكُمْ فِي بُطُونِ أُمَّهَاتِكُمْ خَلْقًا مِّن بَعْدِ خَلْقٍ فِي ظُلُمَاتٍ ثَلَاثٍ",
        "ayah_en": "He creates you in the wombs of your mothers, creation after creation, in three layers of darkness.",
        "reference": "39:6",
        "description": "Modern medicine identifies three protective layers around the developing fetus. The Qur’an mentions these layers centuries before embryology existed, presenting human creation as a carefully protected and gradual process."
    },
    {
        "id": 15,
        "title_en": "Gender Determined from a Drop",
        "title_ar": "تحديد الجنس من النطفة",
        "ayah_ar": "وَأَنَّهُ خَلَقَ الزَّوْجَيْنِ الذَّكَرَ وَالْأُنثَىٰ  مِن نُّطْفَةٍ إِذَا تُمْنَىٰ",
        "ayah_en": "And that He created the two mates, the male and the female, from a drop when it is emitted.",
        "reference": "53:45-46",
        "description": "The Qur’an points to the reproductive fluid as the source of gender determination. Modern genetics confirms that the male contribution determines whether the child will be male or female."
    },
    {
        "id": 16,
        "title_en": "The Moon’s Phases",
        "title_ar": "منازل القمر",
        "ayah_ar": "وَالْقَمَرَ قَدَّرْنَاهُ مَنَازِلَ حَتَّىٰ عَادَ كَالْعُرْجُونِ الْقَدِيمِ",
        "ayah_en": "And the moon—We have determined phases for it until it returns like an old curved date stalk.",
        "reference": "36:39",
        "description": "The Qur’an uses a simple agricultural image to describe the moon’s phases. The comparison to an old date stalk perfectly reflects the moon’s visual cycle as it wanes."
    },
    {
        "id": 17,
        "title_en": "The Expanding Universe",
        "title_ar": "اتساع الكون",
        "ayah_ar": "وَالسَّمَاءَ بَنَيْنَاهَا بِأَيْدٍ وَإِنَّا لَمُوسِعُونَ",
        "ayah_en": "And the heaven We constructed with strength, and indeed, We are expanding it.",
        "reference": "51:47",
        "description": "Modern astronomy confirms that the universe is expanding. The Qur’an stated this reality long before telescopes or modern cosmology existed, encouraging reflection on the vastness of creation."
    },
    {
        "id": 18,
        "title_en": "Celestial Orbits",
        "title_ar": "الأفلاك",
        "ayah_ar": "وَهُوَ الَّذِي خَلَقَ اللَّيْلَ وَالنَّهَارَ وَالشَّمْسَ وَالْقَمَرَ كُلٌّ فِي فَلَكٍ يَسْبَحُونَ",
        "ayah_en": "And He is the One who created the night and the day and the sun and the moon; each is swimming in an orbit.",
        "reference": "21:33",
        "description": "The verse describes celestial bodies moving smoothly in defined paths. This imagery aligns with the precise orbital mechanics that govern the universe."
    },
    {
        "id": 19,
        "title_en": "Unique Fingerprints",
        "title_ar": "البصمات",
        "ayah_ar": "بَلَىٰ قَادِرِينَ عَلَىٰ أَن نُّسَوِّيَ بَنَانَهُ",
        "ayah_en": "Yes, We are able even to restore his fingertips.",
        "reference": "75:4",
        "description": "Fingerprints are unique to every individual. The Qur’an highlights the fingertips as a sign of divine precision, long before forensic science recognized their uniqueness."
    },
    {
        "id": 20,
        "title_en": "Night Covers the Day",
        "title_ar": "تغشية الليل للنهار",
        "ayah_ar": "يُغْشِي اللَّيْلَ النَّهَارَ",
        "ayah_en": "He covers the day with the night.",
        "reference": "7:54",
        "description": "The Qur’an describes night as gently covering day, not replacing it. This reflects the gradual transition caused by Earth’s rotation."
    },
    {
        "id": 21,
        "title_en": "The Glow of Olive Oil",
        "title_ar": "زيت الزيتون",
        "ayah_ar": "يَكَادُ زَيْتُهَا يُضِيءُ وَلَوْ لَمْ تَمْسَسْهُ نَارٌ",
        "ayah_en": "Its oil almost glows even if untouched by fire.",
        "reference": "24:35",
        "description": "This verse highlights the purity and energy of olive oil. Beyond symbolism, olive oil has unique properties that made it a valuable source of light and healing."
    },
    {
        "id": 22,
        "title_en": "Turning the Sleepers",
        "title_ar": "تقليب أهل الكهف",
        "ayah_ar": "وَنُقَلِّبُهُمْ ذَاتَ الْيَمِينِ وَذَاتَ الشِّمَالِ",
        "ayah_en": "And We turned them to the right and to the left.",
        "reference": "18:18",
        "description": "Turning sleepers prevents bodily decay and injury during long periods of immobility. The Qur’an includes this detail naturally within the story of the People of the Cave."
    },
    {
        "id": 23,
        "title_en": "The Female Spider",
        "title_ar": "أنثى العنكبوت",
        "ayah_ar": "كَمَثَلِ الْعَنكَبُوتِ اتَّخَذَتْ بَيْتًا",
        "ayah_en": "Like the spider who builds a house.",
        "reference": "29:41",
        "description": "The verse uses the feminine form, accurately reflecting that female spiders are the web builders. This linguistic precision aligns with zoological observation."
    },
    {
        "id": 24,
        "title_en": "Barrier Between Waters",
        "title_ar": "البرزخ بين المياه",
        "ayah_ar": "مَرَجَ الْبَحْرَيْنِ يَلْتَقِيَانِ  بَيْنَهُمَا بَرْزَخٌ لَّا يَبْغِيَانِ",
        "ayah_en": "He released the two seas, meeting together. Between them is a barrier they do not cross.",
        "reference": "55:19-20",
        "description": "Different bodies of water can meet without fully mixing due to differences in salinity and density. Oceanography later confirmed this phenomenon."
    },
    {
        "id": 25,
        "title_en": "Stages of Human Creation",
        "title_ar": "مراحل خلق الإنسان",
        "ayah_ar": "ثُمَّ خَلَقْنَا النُّطْفَةَ عَلَقَةً فَخَلَقْنَا الْعَلَقَةَ مُضْغَةً",
        "ayah_en": "Then We created the drop into a clinging form, and We created the clinging form into a lump.",
        "reference": "23:14",
        "description": "The Qur’an outlines human development in clear stages. Modern embryology confirms this gradual and ordered process."
    },
    {
        "id": 26,
        "title_en": "Rose-Colored Sky",
        "title_ar": "السماء وردة",
        "ayah_ar": "فَإِذَا انشَقَّتِ السَّمَاءُ فَكَانَتْ وَرْدَةً كَالدِّهَانِ",
        "ayah_en": "When the sky is split open and becomes rose-colored like oil.",
        "reference": "55:37",
        "description": "The Qur’an paints a vivid image of the sky changing color, reflecting extreme cosmic or atmospheric events in a poetic yet striking way."
    },
    {
        "id": 27,
        "title_en": "Waves Beneath Waves",
        "title_ar": "أمواج تحت أمواج",
        "ayah_ar": "أَمْوَاجٌ مِّن فَوْقِهَا أَمْوَاجٌ",
        "ayah_en": "Waves above waves.",
        "reference": "24:40",
        "description": "Modern science discovered internal waves beneath the ocean surface. The Qur’an describes layered darkness and waves long before deep-sea exploration."
    },
    {
        "id": 28,
        "title_en": "The Ear That Never Sleeps",
        "title_ar": "الأذن لا تنام",
        "ayah_ar": "فَضَرَبْنَا عَلَىٰ آذَانِهِمْ فِي الْكَهْفِ سِنِينَ عَدَدًا",
        "ayah_en": "So We sealed their ears in the cave for many years.",
        "reference": "18:11",
        "description": "Hearing remains active during sleep, unlike other senses. The Qur’an highlights this detail with precision in the story of the sleepers."
    },
    {
        "id": 29,
        "title_en": "Pharaoh Preserved",
        "title_ar": "نجاة جسد فرعون",
        "ayah_ar": "فَالْيَوْمَ نُنَجِّيكَ بِبَدَنِكَ لِتَكُونَ لِمَنْ خَلْفَكَ آيَةً",
        "ayah_en": "So today We will save you in body so that you may be a sign for those after you.",
        "reference": "10:92",
        "description": "The Qur’an states that Pharaoh’s body would be preserved as a sign. Today, preserved remains exist as a reminder of power, arrogance, and consequence."
    },
    {
        "id": 30,
        "title_en": "The Speaking Ant",
        "title_ar": "كلام النملة",
        "ayah_ar": "قَالَتْ نَمْلَةٌ يَا أَيُّهَا النَّمْلُ ادْخُلُوا مَسَاكِنَكُمْ",
        "ayah_en": "An ant said, 'O ants, enter your dwellings.'",
        "reference": "27:18",
        "description": "Ants communicate using complex systems involving sound, vibration, and chemical signals. The Qur’an presents this reality naturally, highlighting awareness and communication in even the smallest creatures."
    }
]